
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КолонкиРасшифровки.Добавить("Измерение1","Измерение 1");
	КолонкиРасшифровки.Добавить("Измерение2","Измерение 2");
	КолонкиРасшифровки.Добавить("Измерение3","Измерение 3");
	Результат.Очистить();
	ЭтоКоличество = Ложь;
	УчестьЗначение2 = Ложь;
	УчестьЗначение2Проценты = Ложь;
	УчестьПланРазницу = Ложь;
	УчестьПланОтношение = Ложь;
	ЭтаФорма.ЭтоРасходы = Ложь;
	ЭтаФорма.ПризнакФОТ = Ложь;
	Если Параметры.Свойство("ЭтоРасходы") Тогда
		ЭтаФорма.ЭтоРасходы = Параметры.ЭтоРасходы;
	КонецЕсли;
	Если Параметры.Свойство("ПризнакФОТ") Тогда
		ЭтаФорма.ПризнакФОТ = Параметры.ПризнакФОТ;
	КонецЕсли;
	Если Параметры.Расшифровка.Свойство("ЭтоКоличество") Тогда
		ЭтоКоличество = Параметры.Расшифровка.ЭтоКоличество;
	КонецЕсли;
	Если Параметры.Расшифровка.Свойство("УчестьЗначение2") Тогда
		УчестьЗначение2 = Параметры.Расшифровка.УчестьЗначение2;
	КонецЕсли;
	Если Параметры.Расшифровка.Свойство("УчестьЗначение2Проценты") Тогда
		УчестьЗначение2Проценты = Параметры.Расшифровка.УчестьЗначение2Проценты;
	КонецЕсли;
	Если Параметры.Расшифровка.Свойство("УчестьПланРазницу") Тогда
		УчестьПланРазницу = Параметры.Расшифровка.УчестьПланРазницу;
	КонецЕсли;
	Если Параметры.Расшифровка.Свойство("УчестьПланОтношение") Тогда
		УчестьПланОтношение = Параметры.Расшифровка.УчестьПланОтношение;
	КонецЕсли;
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетРасшифровки");
	Область = Макет.ПолучитьОбласть("Шапка"+?(ПризнакФОТ и Параметры.Показатель = "Сотрудник","ФОТ",""));
	Область.Параметры.Ячейка = "";//Параметры.Расшифровка.Показатель;
	Область.Параметры.Показатель = Параметры.Представление;
	Результат.Вывести(Область);
	ТаблицаРасшифровки = Параметры.Таблица.Получить();
	ТаблицаРасшифровкиСвернутая = ТаблицаРасшифровки.Скопировать();
	ТаблицаРасшифровкиСвернутая.Свернуть(Параметры.Показатель,"Значение");
	ТаблицаРасшифровкиСвернутая.Сортировать(Параметры.Показатель);
	Для Каждого Стр Из ТаблицаРасшифровкиСвернутая Цикл 
		Если Не ЗначениеЗаполнено(Стр[Параметры.Показатель]) И Не ЗначениеЗаполнено(Стр.Значение) Тогда
			Продолжить;
		КонецЕсли;
		Область = Макет.ПолучитьОбласть("Строка"+?(ЭтоКоличество,"Кол","")+?(ПризнакФОТ и Параметры.Показатель = "Сотрудник","ФОТ",""));
		Область.Параметры.Показатель = Стр[Параметры.Показатель];
		Если ПризнакФОТ и Параметры.Показатель = "Сотрудник" Тогда
			Область.Параметры.ПодразделениеОрганизации = Стр.ПодразделениеОрганизации;
			Область.Параметры.ВСтруктуреПредприятия = Стр.ВСтруктуреПредприятия;
			Область.Параметры.Должность = Стр.Должность;
		КонецЕсли;
		Если УчестьЗначение2 И УчестьЗначение2Проценты Тогда
			ЗначениеДоФормата = ?(Стр.Значение2=0,0,100*Стр.Значение/Стр.Значение2);
			Область.Параметры.Значение = Формат(ЗначениеДоФормата,"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%";
			Если УчестьПланРазницу ИЛИ УчестьПланОтношение Тогда 
				ЗначениеПланДоФормата = ?(Стр.Значение2План=0,0,100*Стр.ЗначениеПлан/Стр.Значение2План);
			КонецЕсли;
			Если УчестьПланРазницу Тогда 
				Область.Параметры.Значение = Формат(ЗначениеДоФормата - ЗначениеПланДоФормата,"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%";	
			ИначеЕсли УчестьПланОтношение Тогда 
				Область.Параметры.Значение = ?(ЗначениеПланДоФормата = 0,"-",Формат(100*(ЗначениеДоФормата/ЗначениеПланДоФормата-1),"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%");
			КонецЕсли;
		ИначеЕсли УчестьЗначение2 Тогда
			ЗначениеДоФормата = ?(Стр.Значение2 = 0,0,Стр.Значение/Стр.Значение2);
			Область.Параметры.Значение = ЗначениеДоФормата;
			Если УчестьПланРазницу ИЛИ УчестьПланОтношение Тогда 
				ЗначениеПланДоФормата = ?(Стр.Значение2План=0,0,Стр.ЗначениеПлан/Стр.Значение2План);
			КонецЕсли;
			Если УчестьПланРазницу Тогда 
				Область.Параметры.Значение = ЗначениеДоФормата - ЗначениеПланДоФормата;	
			ИначеЕсли УчестьПланОтношение Тогда 
				Область.Параметры.Значение = ?(ЗначениеПланДоФормата = 0,"-",Формат(100*(ЗначениеДоФормата/ЗначениеПланДоФормата-1),"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%");
			КонецЕсли;
		Иначе
			Область.Параметры.Значение = Стр.Значение;
			Если УчестьПланРазницу Тогда 
				Область.Параметры.Значение = Стр.Значение - Стр.ЗначениеПлан;	
			ИначеЕсли УчестьПланОтношение Тогда 
				Область.Параметры.Значение = ?(Стр.ЗначениеПлан = 0,"-",Формат(100*(Стр.Значение/Стр.ЗначениеПлан-1),"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%");
			КонецЕсли;
		КонецЕсли;		
		Область.Параметры.Значение_СтруктураРасшифровки = 
			Новый Структура("Показатель,Таблица,ЭтоКоличество,УчестьЗначение2,УчестьЗначение2Проценты,ЭтоРасходы,ПризнакФОТ",Стр[Параметры.Показатель],
			Новый ХранилищеЗначения(ТаблицаРасшифровки.Скопировать(Новый Структура(Параметры.Показатель,Стр[Параметры.Показатель]))),ЭтоКоличество,УчестьЗначение2,УчестьЗначение2Проценты,ЭтаФорма.ЭтоРасходы,ЭтаФорма.ПризнакФОТ);
		Результат.Вывести(Область);
	КонецЦикла;	
	Область = Макет.ПолучитьОбласть("Итого"+?(ЭтоКоличество,"Кол",""));
	Если УчестьЗначение2 И УчестьЗначение2Проценты Тогда
		ЗначениеДоФормата = ?(ТаблицаРасшифровки.Итог("Значение2")=0,0,100*ТаблицаРасшифровки.Итог("Значение")/ТаблицаРасшифровки.Итог("Значение2"));
		Область.Параметры.Значение = Формат(ЗначениеДоФормата,"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%";
		Если УчестьПланРазницу ИЛИ УчестьПланОтношение Тогда 
			ЗначениеПланДоФормата = ?(ТаблицаРасшифровки.Итог("Значение2План")=0,0,100*ТаблицаРасшифровки.Итог("ЗначениеПлан")/ТаблицаРасшифровки.Итог("Значение2План"));
		КонецЕсли;
		Если УчестьПланРазницу Тогда 
			Область.Параметры.Значение = Формат(ЗначениеДоФормата - ЗначениеПланДоФормата,"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%";	
		ИначеЕсли УчестьПланОтношение Тогда 
			Область.Параметры.Значение = ?(ЗначениеПланДоФормата = 0,"-",Формат(100*(ЗначениеДоФормата/ЗначениеПланДоФормата-1),"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%");
		КонецЕсли;
	ИначеЕсли УчестьЗначение2 Тогда
		ЗначениеДоФормата = ?(ТаблицаРасшифровки.Итог("Значение2") = 0,0,ТаблицаРасшифровки.Итог("Значение")/ТаблицаРасшифровки.Итог("Значение2"));
		Область.Параметры.Значение = ЗначениеДоФормата;
		Если УчестьПланРазницу ИЛИ УчестьПланОтношение Тогда 
			ЗначениеПланДоФормата = ?(ТаблицаРасшифровки.Итог("Значение2План") = 0,0,ТаблицаРасшифровки.Итог("ЗначениеПлан")/ТаблицаРасшифровки.Итог("Значение2План"));
		КонецЕсли;
		Если УчестьПланРазницу Тогда 
			Область.Параметры.Значение = ЗначениеДоФормата - ЗначениеПланДоФормата;	
		ИначеЕсли УчестьПланОтношение Тогда 
			Область.Параметры.Значение = ?(ЗначениеПланДоФормата = 0,"-",Формат(100*(ЗначениеДоФормата/ЗначениеПланДоФормата-1),"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%");
		КонецЕсли;
	Иначе
		Область.Параметры.Значение = ТаблицаРасшифровки.Итог("Значение");
		Если УчестьПланРазницу Тогда 
			Область.Параметры.Значение = ТаблицаРасшифровки.Итог("Значение") - ТаблицаРасшифровки.Итог("ЗначениеПлан");	
		ИначеЕсли УчестьПланОтношение Тогда 
			Область.Параметры.Значение = ?(ТаблицаРасшифровки.Итог("ЗначениеПлан") = 0,"0,00%",Формат(100*(ТаблицаРасшифровки.Итог("Значение")/ТаблицаРасшифровки.Итог("ЗначениеПлан")-1),"ЧЦ=15; ЧДЦ=2; ЧН=0,00")+"%");
		КонецЕсли;
	КонецЕсли;		
	Результат.Вывести(Область);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказателиРасшифровки = КолонкиРасшифровки.Скопировать();
		ПоказатьВыборИзМеню(Новый ОписаниеОповещения("РезультатОбработкаРасшифровкиЗавершение",ЭтотОбъект,
			Новый Структура("Расшифровка",Расшифровка)), ПоказателиРасшифровки);
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение(ВыбПоказатель, ДополнительныеПараметры) Экспорт
	Если ВыбПоказатель <> Неопределено Тогда
		Расшифровка = ДополнительныеПараметры.Расшифровка;
		Если ВыбПоказатель.Значение  = "Ввести корректировку" Тогда
			Если (ТипЗнч(Расшифровка.Показатель) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
					ИЛИ ТипЗнч(Расшифровка.Показатель) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств")
					ИЛИ ТипЗнч(Расшифровка.Показатель) = Тип("ДокументСсылка.ВзаимозачетЗадолженности")
					ИЛИ ТипЗнч(Расшифровка.Показатель) = Тип("ДокументСсылка.АвансовыйОтчет")) Тогда
				СтруктураОтбора  = Новый Структура("Отбор",Новый Структура("Документ"));
				СтруктураОтбора.Отбор.Документ = Расшифровка.Показатель;
				ОткрытьФорму("РегистрСведений.ITM_КорректирующиеСуммыОтчетаПоСтройкеПоДокументамУУ.ФормаСписка",СтруктураОтбора,ЭтаФорма,Истина);
			КонецЕсли;
		Иначе
			ОткрытьФорму("ВнешнийОтчет.Itm_ОтчетПоСтройкеУУ_2022.Форма.ФормаРасшифровки",
				Новый Структура("Расшифровка,Таблица,Показатель,Представление,ЭтоРасходы,ПризнакФОТ",Расшифровка,Расшифровка.Таблица,ВыбПоказатель.Значение,ВыбПоказатель.Представление,ЭтаФорма.ЭтоРасходы,ЭтаФорма.ПризнакФОТ),ЭтаФорма,Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
