&НаКлиенте
Процедура КомандаСформировать(Команда)
	КомандаСформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьНаСервере()
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаГруппировок",ТабГруппировок.Выгрузить());
	СтруктураВозврата = РеквизитФормыВЗначение("Отчет").СформироватьОтчет(Результат,СтруктураПараметров);
	ДанныеОтчета = СтруктураВозврата.ДанныеОтчета;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НовСтрока = ТабГруппировок.Добавить();
	НовСтрока.Выводить = Истина;
	НовСтрока.ИмяСтроки = "Измерение1";
	НовСтрока.ПредставлениеСтроки = "Измерение 1";
	НовСтрока = ТабГруппировок.Добавить();
	НовСтрока.Выводить = Истина;
	НовСтрока.ИмяСтроки = "Измерение2";
	НовСтрока.ПредставлениеСтроки = "Измерение 2";
	НовСтрока = ТабГруппировок.Добавить();
	НовСтрока.Выводить = Истина;
	НовСтрока.ИмяСтроки = "Измерение3";
	НовСтрока.ПредставлениеСтроки = "Измерение 3";
	КолонкиРасшифровки.Добавить("Измерение1","Измерение 1");
	КолонкиРасшифровки.Добавить("Измерение2","Измерение 2");
	КолонкиРасшифровки.Добавить("Измерение3","Измерение 3");
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказателиРасшифровки = Новый СписокЗначений;
		ПоказателиРасшифровки = КолонкиРасшифровки.Скопировать();
		ПоказатьВыборИзМеню(Новый ОписаниеОповещения("РезультатОбработкаРасшифровкиЗавершение",ЭтотОбъект,
			Новый Структура("Расшифровка",Расшифровка)),ПоказателиРасшифровки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение(ВыбПоказатель, ДополнительныеПараметры) Экспорт
	Если ВыбПоказатель <> Неопределено Тогда
		Расшифровка = ДополнительныеПараметры.Расшифровка;
		ОткрытьФорму("ВнешнийОтчет.прототип_РекурсивныйВыводОтчетаСПроизвольнымиГруппировками.Форма.ФормаРасшифровки",
			Новый Структура("Расшифровка,Таблица,Показатель,Представление",
				Расшифровка,ПолучитьТаблицуПоОтбору(Расшифровка),ВыбПоказатель.Значение,ВыбПоказатель.Представление),ЭтаФорма,Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоОтбору(Расшифровка)
	Таблица = ДанныеОтчета.Получить();
	Если Расшифровка.Отбор.Количество() = 0 Тогда
		ПромТаб = Таблица.Скопировать();
	Иначе		
		ПромТаб = Таблица.Скопировать(Расшифровка.Отбор);
	КонецЕсли;
	Возврат Новый ХранилищеЗначения(ПромТаб, Новый СжатиеДанных(9));
КонецФункции

